import { FaultTreeBuilder } from "../../../shared/lib/tree/model/tree.ts";

export const tree = new FaultTreeBuilder()
    .basic("F1", "Длительные осадки", 0.4)
    .basic("F2", "Ливень", 0.4)
    .basic("F3", "Таяние снега", 1)
    .basic("F5", "Осадки + таяние", 0.2)
    .basic("F6", "Ледовый затор", 0.1)
    .basic("F7", "Обрушение льда", 0.2)
    .basic("F8", "Засорение деревьями", 0.3)
    .basic("F9", "Мусор в русле", 0.2)
    .basic("F10", "Сужение русла", 0.4)
    .basic("F11", "Заиливание", 0.2)
    .basic("F12", "Малая пропускная способность", 0.15)
    .basic("F13", "Засорение канализации", 0.1)
    .basic("F15", "Переполнение", 0.1)
    .basic("F16", "Отказ насоса", 0.05)
    .basic("F17", "Нет питания", 0.4)
    .basic("F18", "Отказ автоматики", 0.04)
    .basic("F19", "Разгерметизация дамбы", 0.02)
    .basic("F20", "Низкая дамба", 0.2)
    .basic("F21", "Размыв основания", 0.9)
    .basic("F23", "Просадка", 0.02)
    .basic("F24", "Насыщение грунта", 0.04)

    .gate("G10", "Рост стока", "OR")
    .gate("G12", "Проблемы русла", "OR")
    .gate("G13", "Ледяной затор", "AND")
    .gate("G11", "Отвод воды", "OR")
    .gate("G17", "Насосная станция", "OR")

    .gate("G2", "Рост уровня воды", "OR")
    .gate("G3", "Перелив дамбы", "AND")
    .gate("G4", "Разрушение дамбы", "OR")
    .gate("G5", "Отказ водоотведения", "OR")

    .gate("G1", "Наводнение", "AND")

    .link("G10", "F1", "F2", "F3", "F5")
    .link("G12", "F10", "F11", "F8", "F9")
    .link("G13", "F6", "F7")
    .link("G11", "F12", "F13", "F15")
    .link("G17", "F16", "F17", "F18")

    .link("G2", "G10", "G12", "G13")
    .link("G3", "G2", "F20")
    .link("G4", "F19", "F21", "F23", "F24")
    .link("G5", "G11", "G17")

    .link("G1", "G2", "G3", "G4", "G5")

    .build("G1");
tree.print();
console.log("Вероятность полного отказа:", tree.calculate());